src/cf/InformationRegisters/вогСтатусыСогласованияОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогСтатусыСогласованияОбъектов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.вогСтатусыСогласования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>РегистраторСтатуса</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.вогОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/вогСвязиРаспределительныхЦентров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогСвязиРаспределительныхЦентров</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>РаспределительныйЦентр</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогРаспределительныеЦентры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСвязи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.вогОбъектыСвязейПартнеров</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/вогСвязиЮридическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогСвязиЮридическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ЮридическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ОбъектСвязи</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.вогОбъектыСвязейПартнеров</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/InformationRegisters/вогСвязиТТСТТДистрибутором.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<InformationRegister>
		<Properties>
			<Name>вогСвязиТТСТТДистрибутором</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочкаДистрибутор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогТорговыеТочки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/вогСтатусыСогласования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>вогСтатусыСогласования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаСогласовании</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеСогласован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Создан</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Заблокирован</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/вогСостоянияОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Enum>
		<Properties>
			<Name>вогСостоянияОбмена</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Зарегистрирован</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Успешно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Ошибка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОшибкаПроверки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/вогЮридическиеЛица.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>вогЮридическиеЛица</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ОрганизационноПравоваяФорма</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогОрганизационноПравовыеФормы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Публичное наименование, например, для печати или устного обращения.</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Изображение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогЮридическиеЛицаПрисоединенныеФайлы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодПоОКПО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГоловноеЮрЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.вогЮридическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРегистрации</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СвидетельствоСерия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеСерияНомер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойБанковскийСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Розничный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтактнаяИнформация</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тип</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вид</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыКонтактнойИнформации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначенияПолей</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Страна</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регион</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Город</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресЭП</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоменноеИмяСервера</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефона</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерТелефонаБезКодов</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>CRM_ОсновнойДляСвязи</Name>
							<Comment>Основной вид контактной информации для связи</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Организации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Организация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Подразделения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CRM_Теги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Тег</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CRM_Теги</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/вогСтатусыСогласованияОбъектов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ПроверитьСогласованиеОбъектов(ОбъектСсылка, СтруктураВозврата, СлужебнаяВыгрузка = Ложь, Отказ) Экспорт
	
	Если СлужебнаяВыгрузка Тогда
		Возврат;
	КонецЕсли;
	
	ВыводСообщений = Истина;
	
	Если СтруктураВозврата.Свойство("ВыводСообщений")
		И ТипЗнч(СтруктураВозврата.ВыводСообщений) = Тип("Булево") Тогда
		ВыводСообщений = СтруктураВозврата.ВыводСообщений;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вогТорговыеТочки.Ссылка КАК Ссылка,
	|	вогТорговыеТочки.Партнер КАК Партнер
	|ПОМЕСТИТЬ ВТ_ИсточникПроверки
	|ИЗ
	|	Справочник.вогТорговыеТочки КАК вогТорговыеТочки
	|ГДЕ
	|	вогТорговыеТочки.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вогЮридическиеЛица.Ссылка,
	|	вогЮридическиеЛица.Партнер
	|ИЗ
	|	Справочник.вогЮридическиеЛица КАК вогЮридическиеЛица
	|ГДЕ
	|	вогЮридическиеЛица.Ссылка = &Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вогРаспределительныеЦентры.Ссылка,
	|	ВЫРАЗИТЬ(вогСвязиРаспределительныхЦентров.ОбъектСвязи КАК Справочник.вогТорговыеТочки).Партнер
	|ИЗ
	|	Справочник.вогРаспределительныеЦентры КАК вогРаспределительныеЦентры
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вогСвязиРаспределительныхЦентров КАК вогСвязиРаспределительныхЦентров
	|		ПО вогРаспределительныеЦентры.Ссылка = вогСвязиРаспределительныхЦентров.РаспределительныйЦентр
	|ГДЕ
	|	вогРаспределительныеЦентры.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СпрПартнеры.Ссылка КАК Ссылка
	|ПОМЕСТИТЬ ВТ_ИсточникПроверки_Партнер
	|ИЗ
	|	Справочник.Партнеры КАК СпрПартнеры
	|ГДЕ
	|	СпрПартнеры.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ВТ_ИсточникПроверки.Ссылка КАК ИсточникСвязи,
	|	ВЫБОР
	|		КОГДА ВТ_ИсточникПроверки.Ссылка ССЫЛКА Справочник.вогЮридическиеЛица
	|			ТОГДА вогСвязиСТТ.ОбъектСвязи
	|		КОГДА ВТ_ИсточникПроверки.Ссылка ССЫЛКА Справочник.вогТорговыеТочки
	|				И ВЫРАЗИТЬ(ВТ_ИсточникПроверки.Ссылка КАК Справочник.вогТорговыеТочки).Вид = ЗНАЧЕНИЕ(Справочник.вогВидыТорговыхТочек.ТРТД)
	|			ТОГДА СвязиЮридическихЛицТРТД.ЮридическоеЛицо
	|		КОГДА ВТ_ИсточникПроверки.Ссылка ССЫЛКА Справочник.вогТорговыеТочки
	|			ТОГДА вогСвязиСЮрЛицами.ЮридическоеЛицо
	|		КОГДА ВТ_ИсточникПроверки.Ссылка ССЫЛКА Справочник.вогРаспределительныеЦентры
	|			ТОГДА вогСвязиРаспределительныхЦентров.ОбъектСвязи
	|	КОНЕЦ КАК ОбъектСвязи,
	|	СпрПартнеры.Ссылка КАК Партнер
	|ПОМЕСТИТЬ ВТ_ОбъектыПроверки
	|ИЗ
	|	ВТ_ИсточникПроверки КАК ВТ_ИсточникПроверки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вогСвязиЮридическихЛиц КАК вогСвязиСТТ
	|		ПО ВТ_ИсточникПроверки.Ссылка = вогСвязиСТТ.ЮридическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вогСвязиЮридическихЛиц КАК вогСвязиСЮрЛицами
	|		ПО ВТ_ИсточникПроверки.Ссылка = вогСвязиСЮрЛицами.ОбъектСвязи
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Партнеры КАК СпрПартнеры
	|		ПО ВТ_ИсточникПроверки.Партнер = СпрПартнеры.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вогСвязиРаспределительныхЦентров КАК вогСвязиРаспределительныхЦентров
	|		ПО ВТ_ИсточникПроверки.Ссылка = вогСвязиРаспределительныхЦентров.РаспределительныйЦентр
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вогСвязиТТСТТДистрибутором КАК вогСвязиТТСТТДистрибутором
	|			ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.вогСвязиЮридическихЛиц КАК СвязиЮридическихЛицТРТД
	|			ПО вогСвязиТТСТТДистрибутором.ТорговаяТочкаДистрибутор = СвязиЮридическихЛицТРТД.ОбъектСвязи
	|		ПО ВТ_ИсточникПроверки.Ссылка = вогСвязиТТСТТДистрибутором.ТорговаяТочка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	вогТорговыеТочки.Ссылка,
	|	вогЮридическиеЛица.Ссылка,
	|	ВТ_ИсточникПроверки_Партнер.Ссылка
	|ИЗ
	|	ВТ_ИсточникПроверки_Партнер КАК ВТ_ИсточникПроверки_Партнер
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.вогТорговыеТочки КАК вогТорговыеТочки
	|		ПО ВТ_ИсточникПроверки_Партнер.Ссылка = вогТорговыеТочки.Партнер
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.вогЮридическиеЛица КАК вогЮридическиеЛица
	|		ПО ВТ_ИсточникПроверки_Партнер.Ссылка = вогЮридическиеЛица.Партнер
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вогСтатусыСогласованияОбъектов1.Статус КАК СтатусИсточникСвязи,
	|	ВЫБОР
	|		КОГДА ВТ_ОбъектыПроверки.ИсточникСвязи ССЫЛКА Справочник.вогТорговыеТочки
	|				И ВЫРАЗИТЬ(ВТ_ОбъектыПроверки.ИсточникСвязи КАК Справочник.вогТорговыеТочки).Вид = ЗНАЧЕНИЕ(Справочник.вогВидыТорговыхТочек.ТРТД)
	|			ТОГДА ЗНАЧЕНИЕ(Перечисление.вогСтатусыСогласования.Согласован)
	|		ИНАЧЕ вогСтатусыСогласованияОбъектов2.Статус
	|	КОНЕЦ КАК СтатусОбъектСвязи,
	|	вогСтатусыСогласованияОбъектов3.Статус КАК СтатусПартнер
	|ПОМЕСТИТЬ ВТ_СтатусыОбъектов
	|ИЗ
	|	ВТ_ОбъектыПроверки КАК ВТ_ОбъектыПроверки
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вогСтатусыСогласованияОбъектов.СрезПоследних КАК вогСтатусыСогласованияОбъектов1
	|		ПО ВТ_ОбъектыПроверки.ИсточникСвязи = вогСтатусыСогласованияОбъектов1.Объект
	|			И (вогСтатусыСогласованияОбъектов1.Статус = ЗНАЧЕНИЕ(Перечисление.вогСтатусыСогласования.Согласован)
	// VOG Ульянов И.В. 20.04.2020 CRM-568
	|				ИЛИ вогСтатусыСогласованияОбъектов1.Статус = ЗНАЧЕНИЕ(Перечисление.вогСтатусыСогласования.Заблокирован))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вогСтатусыСогласованияОбъектов.СрезПоследних КАК вогСтатусыСогласованияОбъектов2
	|		ПО ВТ_ОбъектыПроверки.ОбъектСвязи = вогСтатусыСогласованияОбъектов2.Объект
	|			И (вогСтатусыСогласованияОбъектов2.Статус = ЗНАЧЕНИЕ(Перечисление.вогСтатусыСогласования.Согласован)
	// VOG Ульянов И.В. 20.04.2020 CRM-568
	|				ИЛИ вогСтатусыСогласованияОбъектов2.Статус = ЗНАЧЕНИЕ(Перечисление.вогСтатусыСогласования.Заблокирован))
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.вогСтатусыСогласованияОбъектов.СрезПоследних КАК вогСтатусыСогласованияОбъектов3
	|		ПО ВТ_ОбъектыПроверки.Партнер = вогСтатусыСогласованияОбъектов3.Объект
	|			И (вогСтатусыСогласованияОбъектов3.Статус = ЗНАЧЕНИЕ(Перечисление.вогСтатусыСогласования.Согласован)
	// VOG Ульянов И.В. 20.04.2020 CRM-568
	|				ИЛИ вогСтатусыСогласованияОбъектов3.Статус = ЗНАЧЕНИЕ(Перечисление.вогСтатусыСогласования.Заблокирован))
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ВЫБОР
	|		КОГДА НЕ ВТ_СтатусыОбъектов.СтатусИсточникСвязи ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ КАК СтатусИсточникСвязи,
	|	ЛОЖЬ КАК СтатусОбъектСвязи,
	|	ЛОЖЬ КАК СтатусПартнер
	|ПОМЕСТИТЬ ВТ_Проверка
	|ИЗ
	|	ВТ_СтатусыОбъектов КАК ВТ_СтатусыОбъектов
	|ГДЕ
	|	НЕ ВТ_СтатусыОбъектов.СтатусИсточникСвязи ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_СтатусыОбъектов.СтатусОбъектСвязи ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ,
	|	ЛОЖЬ
	|ИЗ
	|	ВТ_СтатусыОбъектов КАК ВТ_СтатусыОбъектов
	|ГДЕ
	|	НЕ ВТ_СтатусыОбъектов.СтатусОбъектСвязи ЕСТЬ NULL
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	ВЫБОР
	|		КОГДА НЕ ВТ_СтатусыОбъектов.СтатусПартнер ЕСТЬ NULL
	|			ТОГДА ИСТИНА
	|		ИНАЧЕ ЛОЖЬ
	|	КОНЕЦ
	|ИЗ
	|	ВТ_СтатусыОбъектов КАК ВТ_СтатусыОбъектов
	|ГДЕ
	|	НЕ ВТ_СтатусыОбъектов.СтатусПартнер ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(МАКСИМУМ(ВТ_Проверка.СтатусИсточникСвязи), ЛОЖЬ) КАК ИсточникСвязиСогласован,
	|	ЕСТЬNULL(МАКСИМУМ(ВТ_Проверка.СтатусОбъектСвязи), ЛОЖЬ) КАК ОбъектСвязиСогласован,
	|	ЕСТЬNULL(МАКСИМУМ(ВТ_Проверка.СтатусПартнер), ЛОЖЬ) КАК ПартнерСогласован
	|ИЗ
	|	ВТ_Проверка КАК ВТ_Проверка";
	
	Запрос.УстановитьПараметр("Ссылка", ОбъектСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Если Не Выборка.ИсточникСвязиСогласован
			Или Не Выборка.ОбъектСвязиСогласован
			Или Не Выборка.ПартнерСогласован Тогда
			
			Отказ = Истина;
			
		КонецЕсли;
		
	КонецЦикла;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Отказ Тогда
		
		СтруктураВозврата.ТекстПояснения 	= НСтр("ru = 'Согласованы не все объекты!'");
		СтруктураВозврата.Состояние 		= Перечисления.вогСостоянияОбмена.ОшибкаПроверки;
		
		Если ВыводСообщений Тогда
			ТекстСообщения = НСтр("ru = 'Согласованы не все объекты. Выгрузка прервана!'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
